In [841]:
import pandas as pd

# Load CSV file with forward slashes
df = pd.read_csv("dataset_directory/archive/Bengaluru_House_Data.csv")

# Display the dataframe
print(df.head())

              area_type   availability                  location       size  \
0  Super built-up  Area         19-Dec  Electronic City Phase II      2 BHK
1            Plot  Area  Ready To Move          Chikka Tirupathi  4 Bedroom
2        Built-up  Area  Ready To Move               Uttarahalli      3 BHK
3  Super built-up  Area  Ready To Move        Lingadheeranahalli      3 BHK
4  Super built-up  Area  Ready To Move                  Kothanur      2 BHK

   society total_sqft  bath  balcony   price
0  Coomee        1056   2.0      1.0   39.07
1  Theanmp       2600   5.0      3.0  120.00
2      NaN       1440   2.0      3.0   62.00
3  Soiewre       1521   3.0      1.0   95.00
4      NaN       1200   2.0      1.0   51.00

In [843]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [845]:
df.describe()

               bath       balcony         price
count  13247.000000  12711.000000  13320.000000
mean       2.692610      1.584376    112.565627
std        1.341458      0.817263    148.971674
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     72.000000
75%        3.000000      2.000000    120.000000
max       40.000000      3.000000   3600.000000

In [849]:
df.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [853]:
data=df.drop(['area_type','availability','balcony','society'],axis=1)

In [909]:

for col in [col for col in data.columns if data[col].dtypes == "object"]:
  value_counts = data[col].value_counts()
  print(f"Value counts for the column '{data[col].name}':\n{value_counts}")
  print('*'*40)

Value counts for the column 'location':
location
other                 2885
Whitefield             542
Sarjapur  Road         399
Electronic City        304
Kanakpura Road         273
                      ...
Nehru Nagar             11
Banjara Layout          11
LB Shastri Nagar        11
Pattandur Agrahara      11
Narayanapura            11
Name: count, Length: 242, dtype: int64
****************************************
Value counts for the column 'size':
size
2 BHK         5215
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: count, dtype: int64
****************************************

In [863]:
data.isna().sum()

location       0
size           0
total_sqft     0
bath          73
price          0
dtype: int64

In [857]:
data['location']=data['location'].fillna('Whitefield')

In [861]:
data['size']=data['size'].fillna('2 BHK')

In [761]:
df['balcony']=df['balcony'].fillna(df['balcony'].median())

In [865]:
data['bath']=data['bath'].fillna(df['bath'].median())

In [871]:
data['BHK']=data['size'].apply(lambda x:int(x.split(" ")[0]))

In [873]:
data['total_sqft']=data['total_sqft'].apply(lambda x:(sum(map(clean_and_convert,x.split('-')))/2) if '-' in x else clean_and_convert(x))

In [875]:
data['total_sqft'].isnull().sum()

0

In [877]:
data['location']=data['location'].apply(lambda x: x.strip())
location_count=data['location'].value_counts()
less10=location_count[location_count<=10]

In [879]:
data['location']=data['location'].apply(lambda x:'other' if x in less10 else x )

In [881]:
data['pricepersqft']=data['price']*100000/data['total_sqft']

In [883]:
data2=data[~(data.total_sqft/data.BHK<300)]
data2.head(10)

,location,size,total_sqft,bath,price,BHK,pricepersqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000
5,Whitefield,2 BHK,1170.0,2.0,38.00,2,3247.863248
6,Old Airport Road,4 BHK,2732.0,4.0,204.00,4,7467.057101
7,Rajaji Nagar,4 BHK,3300.0,4.0,600.00,4,18181.818182
8,Marathahalli,3 BHK,1310.0,3.0,63.25,3,4828.244275
10,Whitefield,3 BHK,1800.0,2.0,70.00,3,3888.888889

In [805]:
def remove_bhk_outliers(df):
    exclude_indices=np.array([])
    for location, location_df in df.groupby('location'):
        bhk_sats={}
        for BHK,BHK_df in location_df.groupby('BHK'):
            bhk_sats[BHK]={
                'mean':np.mean(BHK_df.pricepersqft),
                'std':np.std(BHK_df.pricepersqft),
                'count':BHK_df.shape[0]
            }
        for BHK,BHK_df in location_df.groupby('BHK'):
            stats=bhk_sats.get(BHK-1)
            if stats and stats['count']>5:
                exclude_indices = np.append(exclude_indices, BHK_df[BHK_df.pricepersqft < (stats['mean'])].index.values)
    return df.drop(exclude_indices, axis='index')

In [885]:
datat3 = remove_outlers(data2)

In [801]:
import numpy as np
def remove_outlers(df):
    dfs=[]
    for key,subdf in df.groupby('location'):
        m=np.mean(subdf.pricepersqft)
        st=np.std(subdf.pricepersqft)
        reduced_df=subdf[(subdf.pricepersqft>(m-st))&(subdf.pricepersqft<(m+st))]
        dfs.append(reduced_df)
    df_cleaned=pd.concat(dfs,ignore_index=True)
    return df_cleaned

In [889]:
data4 = remove_bhk_outliers(datat3)
data4.shape

(7361, 7)

In [893]:
data5=data4[data4.bath<data4.BHK+2]
data5.shape

(7282, 7)

In [897]:
data6=data5.drop(['size','pricepersqft'],axis='columns')
data6

                  location  total_sqft  bath  price  BHK
0      1st Block Jayanagar      2850.0   4.0  428.0    4
1      1st Block Jayanagar      1630.0   3.0  194.0    3
2      1st Block Jayanagar      1875.0   2.0  235.0    3
3      1st Block Jayanagar      1200.0   2.0  130.0    3
4      1st Block Jayanagar      1235.0   2.0  148.0    2
...                    ...         ...   ...    ...  ...
10299                other      1200.0   2.0   70.0    2
10300                other      1800.0   1.0  200.0    1
10303                other      1353.0   2.0  110.0    2
10304                other       812.0   1.0   26.0    1
10307                other      3600.0   5.0  400.0    4

[7282 rows x 5 columns]

In [899]:
data6.dtypes

location       object
total_sqft    float64
bath          float64
price         float64
BHK             int64
dtype: object

In [907]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler, OneHotEncoder
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import Pipeline

# One-hot encode categorical features (e.g., location, area_type, etc.)
categorical_cols = ['location']
numeric_cols = ['total_sqft', 'bath','BHK',]


X=data6.drop(columns=['price'])
y=data6['price']
# Create column transformer to handle preprocessing
preprocessor = ColumnTransformer(
    transformers=[
        ('num', StandardScaler(), numeric_cols),
        ('cat', OneHotEncoder(), categorical_cols)
    ])

# Create a pipeline with preprocessing and a model (e.g., RandomForestRegressor)
from sklearn.ensemble import RandomForestRegressor

pipeline = Pipeline(steps=[
    ('preprocessor', preprocessor),
    ('model', RandomForestRegressor())
])

# Split the data into training and test sets
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

# Fit the model
pipeline.fit(X_train, y_train)

# Evaluate the model
score = pipeline.score(X_test, y_test)
print(f"Model R^2 score on test data: {score}")

Model R^2 score on test data: 0.8957705384288104

In [867]:
print('*'*50)

**************************************************

In [923]:


def price_predict(location, sqft, bath, BHK):
    """
    Predict the price of a property given its features.

    Parameters:
    - location: str, the location of the property.
    - sqft: float, total square feet of the property.
    - bath: int, number of bathrooms.
    - BHK: int, number of bedrooms.

    Returns:
    - Predicted price for the input features in Lakhs.
    """
    # Create a DataFrame for the input features
    input_data = pd.DataFrame({
        'location': [location],
        'total_sqft': [sqft],
        'bath': [bath],
        'BHK': [BHK]
    })
    
    # Use the pipeline to predict the price
    predicted_price = pipeline.predict(input_data)
    
    return predicted_price[0]

In [913]:
price_predict('Whitefield', 1200, 2, 2)

70.85549486595276

In [915]:
price_predict('1st Phase JP Nagar',1000,2,2)

64.82

In [917]:
price_predict('1st Phase JP Nagar',1000,2,3)

64.83

In [919]:
price_predict('5th Phase JP Nagar',1000,2,2)

49.86

In [921]:
price_predict('Indira Nagar',1000,2,2)

52.062000000000005

In [925]:
score = pipeline.score(X_test, y_test)
print(f"Model R^2 score on test data: {score}")

Model R^2 score on test data: 0.8957705384288104